#+TITLE: Setup Kubernetes on Packet
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 19th of February, 2019
#+PROPERTY: header-args:shell :results output code verbatim replace
#+NOPROPERTY: header-args:shell+ :prologue ". /etc/profile.d/homedir-go-path.sh\n. /etc/profile.d/system-go-path.sh\nexec 2>&1\n"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+PROPERTY: header-args:shell+ :dir "/ssh:root@139.178.88.146:/home/"
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
#+NOPROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+STARTUP: showeverything

** Install kubeadm, kubelet, and kubectl
   #+NAME: Install kubeadm, kubelet, and kubectl, disable swap
   #+BEGIN_SRC tmate
     apt-get update \
       && apt-get install -y apt-transport-https
     curl -s https://packages.cloud.google.com/apt/doc/apt-key.gpg \
       | apt-key add -
     echo "deb http://apt.kubernetes.io/ kubernetes-xenial main" \
       >> /etc/apt/sources.list.d/kubernetes.list
     apt-get update \
       && apt-get install -y docker.io kubelet kubeadm kubectl kubernetes-cni
   #+END_SRC
   
   Verify it worked.  The results should largely match our example included below
   #+NAME: kubectl, kubeadm, kubelet versions
   #+BEGIN_SRC shell :results output verbatim
     echo "==kubelet=="
     kubelet --version
     echo "==kubectl=="
     kubectl version
     echo "==kubeadm=="
     kubeadm version
   #+END_SRC

   #+RESULTS: kubectl, kubeadm, kubelet versions
   #+BEGIN_EXAMPLE :noeval t
   ==kubelet==
   Kubernetes v1.13.3
   ==kubectl==
   Client Version: version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:08:12Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/amd64"}
   ==kubeadm==
   kubeadm version: &version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:05:53Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/amd64"}
   #+END_EXAMPLE

   #+NAME: Example Working versions of kubectl, kubeadm, kubelet
   #+BEGIN_EXAMPLE :noeval t
   ==kubelet==
   Kubernetes v1.13.3
   ==kubectl==
   Client Version: version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:08:12Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/amd64"}
   ==kubeadm==
   kubeadm version: &version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:05:53Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/amd64"}
   #+END_EXAMPLE

   NOTE: If these don't show anything, try running the install script again. It might have installed curl and then stopped...so try again now that curl is installed.
* kubectl
  Let's check that kubectl works.  A good way to do that is to ask it to run commands against our cluster.
  
  #+NAME: Check Kubectl Works
  #+BEGIN_SRC shell
    kubectl get nodes 
  #+END_SRC

  #+RESULTS: Check Kubectl Works
  #+BEGIN_EXAMPLE :noeval t
  NAME         STATUS     ROLES    AGE   VERSION
  ci.ii.coop   NotReady   master   38s   v1.13.3
  #+END_EXAMPLE
  
  
Might be good to show the taints, notready status via kubectl commands before untainting and applying network.

#+NAME: master node taints
#+BEGIN_SRC shell :wrap "SRC json" :prologue (symbol-value nil) :epilogue (symbol-value nil)
  kubectl get node \
    $(kubectl get node \
      -l node-role.kubernetes.io/master \
      --namespace=kube-system \
      -o jsonpath='{.items[*].metadata.name}')\
    -o json \
  | jq -M .spec.taints
  #+END_SRC

  #+RESULTS: master node taints
  #+BEGIN_SRC json
  [
    {
      "effect": "NoSchedule",
      "key": "node-role.kubernetes.io/master"
    },
    {
      "effect": "NoSchedule",
      "key": "node.kubernetes.io/not-ready"
    }
  ]
  #+END_SRC

Usually pods don't get scheduled on the master, due to the NoSchedule taint

  #+NAME: untaint the master
  #+BEGIN_SRC tmate
    kubectl taint nodes --all node-role.kubernetes.io/master-
  #+END_SRC

#+NAME: master node taints after untaint for master role
#+BEGIN_SRC shell :wrap "SRC json" :prologue (symbol-value nil) :epilogue (symbol-value nil)
  kubectl get node \
    $(kubectl get node \
      -l node-role.kubernetes.io/master \
      --namespace=kube-system \
      -o jsonpath='{.items[*].metadata.name}')\
    -o json \
  | jq -M .spec.taints
  #+END_SRC

  #+RESULTS: master node taints after untaint for master role
  #+BEGIN_SRC json
  [
    {
      "effect": "NoSchedule",
      "key": "node.kubernetes.io/not-ready"
    }
  ]
  #+END_SRC

  #+NAME: Status Ready Condition of Master Node
  #+BEGIN_SRC shell :wrap "SRC json" :prologue (symbol-value nil) :epilogue (symbol-value nil)
  kubectl get node \
    $(kubectl get node -l node-role.kubernetes.io/master --namespace=kube-system -o jsonpath='{.items[*].metadata.name}')\
     -o json \
  | jq -M '.status.conditions[] | select(.type=="Ready")'
  #+END_SRC

We likely haven't setup a CNI / network layer yet, no our node doesn't have a status.condition["Ready"} of True.

  #+RESULTS: Status Ready Condition of Master Node
  #+BEGIN_SRC json
  {
    "lastHeartbeatTime": "2019-02-21T01:42:42Z",
    "lastTransitionTime": "2019-02-21T01:41:57Z",
    "message": "runtime network not ready: NetworkReady=false reason:NetworkPluginNotReady message:docker: network plugin is not ready: cni config uninitialized",
    "reason": "KubeletNotReady",
    "status": "False",
    "type": "Ready"
  }
  #+END_SRC

* networking
  
https://docs.projectcalico.org/v3.5/usage/calicoctl/install

TODO add other options linked in our dm channel (flannel, weaver)
  We were able to look at all our nodes but =coredns= was still pending, and not ready.  As long as =coredns= is down, we cannot schedule or have nodes talk to one another.  In other words, nothing will work.

~flannel~
  Flannel is a CNI (container network interface) that essentially helps get our network up.  So let's install it. 
  
#+BEGIN_SRC tmate
FLANNEL_RELEASE=v0.11.0
kubectl apply -f https://raw.githubusercontent.com/coreos/flannel/$FLANNEL_RELEASE/Documentation/kube-flannel.yml
#+END_SRC

  #+NAME: Status Ready Condition of Master Node after networking
  #+BEGIN_SRC shell :wrap "SRC json" :prologue (symbol-value nil) :epilogue (symbol-value nil)
  kubectl get node \
    $(kubectl get node -l node-role.kubernetes.io/master --namespace=kube-system -o jsonpath='{.items[*].metadata.name}')\
     -o json \
  | jq -M '.status.conditions[] | select(.type=="Ready")'
  #+END_SRC

  #+RESULTS: Status Ready Condition of Master Node after networking
  #+BEGIN_SRC json
  {
    "lastHeartbeatTime": "2019-02-21T07:32:38Z",
    "lastTransitionTime": "2019-02-21T07:32:38Z",
    "message": "kubelet is posting ready status. AppArmor enabled",
    "reason": "KubeletReady",
    "status": "True",
    "type": "Ready"
  }
  #+END_SRC

#+NAME: node should be ready
#+BEGIN_SRC shell
  kubectl get nodes
#+END_SRC	

#+RESULTS: node should be ready
#+BEGIN_EXAMPLE :noeval t
NAME         STATUS   ROLES    AGE     VERSION
ci.ii.coop   Ready    master   3m52s   v1.13.3
#+END_EXAMPLE

* webui

https://kubernetes.io/docs/tasks/access-application-cluster/web-ui-dashboard/

#+BEGIN_SRC tmate
kubectl create -f https://raw.githubusercontent.com/kubernetes/dashboard/master/aio/deploy/recommended/kubernetes-dashboard.yaml
#+END_SRC

Forward your localhost:8001 to the remote localhost:8001 (start the proxy once, other folks/hosts will connect to the one proxy)
#+BEGIN_SRC :eval never
ssh -L 8001:localhost:8001 root@139.178.88.146 kubectl proxy
#+END_SRC

#+NAME: create service account
#+BEGIN_SRC tmate
    cat <<-EOF | kubectl apply -f -
      apiVersion: v1
      kind: ServiceAccount
      metadata:
        name: admin-user
        namespace: kube-system
    EOF
#+END_SRC

#+NAME: create service account
#+BEGIN_SRC tmate
    cat <<-EOF | kubectl apply -f -
      apiVersion: rbac.authorization.k8s.io/v1beta1
      kind: ClusterRoleBinding
      metadata:
        name: admin-user
      roleRef:
        apiGroup: rbac.authorization.k8s.io
        kind: ClusterRole
        name: cluster-admin
      subjects:
      - kind: ServiceAccount
        name: admin-user
        namespace: kube-system
    EOF
#+END_SRC

#+NAME: admin_token
#+BEGIN_SRC shell
kubectl get -n kube-system -o json secret \
  `kubectl get secret -n kube-system | grep admin-user | awk '{print $1}'` \
  | jq -r .data.token \
  | base64 --decode
#+END_SRC

#+RESULTS: admin_token
#+BEGIN_EXAMPLE :noeval t
eyJhbGciOiJSUzI1NiIsImtpZCI6IiJ9.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJrdWJlLXN5c3RlbSIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VjcmV0Lm5hbWUiOiJhZG1pbi11c2VyLXRva2VuLXc5cnFqIiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZXJ2aWNlLWFjY291bnQubmFtZSI6ImFkbWluLXVzZXIiLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC51aWQiOiJjNjQ1MDExZS0zNWZjLTExZTktYWFhMy05ODAzOWIzMDIzODYiLCJzdWIiOiJzeXN0ZW06c2VydmljZWFjY291bnQ6a3ViZS1zeXN0ZW06YWRtaW4tdXNlciJ9.l4Njhars0ri5JtJuD2e1bk3BFMmkWvBsgqmgkmAUG4wy7469-g96a86IpsFkzh5LfnJXRjWoP0fEphyE_yjHVkkvpuzUyr4mXLbIUSshS3cIgyi4swc6_UMuIS0pwFupdrOvRc7UYDP4UmEOVcBxmo3psATP0Zb9F_-5Pcedlja4fD6QVc5F46owjpqUoMPPrwdlcEsNF586-Yg2IzN4Ku5SppUl7q9l2zFvdhkIQDWNhzZyBoJfRqoRGJKxiokIz-t-xjSjk1U7q3u1uuY0bDCLHEgxPZwhZNsnm6C0ENn5t2Gh67Oquz33eQCauagbLgCNdKI_B1YacJo-L_O6VQ
#+END_EXAMPLE

http://localhost:8001/api/v1/namespaces/kube-system/services/https:kubernetes-dashboard:/proxy/

